Revit 2026 API

# AssetProperty Class

---

Represents a property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty More

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetProperty : IDisposable
```
```vb
Public Class AssetProperty
	Implements IDisposable
```
```cpp
public ref class AssetProperty : IDisposable
```
```fsharp
type AssetProperty =
    class
        interface IDisposable
    end
```

The AssetProperty type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | Get the name of the AssetProperty |
|  | NumberOfConnectedProperties | The number of currently connected properties. |
|  | Type | Returns the type of the AssetProperty |

|  | Name | Description |
| --- | --- | --- |
|  | AddConnectedAsset | Adds a new connected asset attached to this asset property, if it allows it. |
|  | AddCopyAsConnectedAsset | Makes a copy of the asset and connects it to this property. |
|  | Dispose | Releases all resources used by the AssetProperty |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAllConnectedProperties | Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime. |
|  | GetConnectedProperty | Gets one connected property with specified index. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSingleConnectedAsset | Gets the single connected asset attached to this asset property, if it exists. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetTypeName | Get the name of the AssetProperty |
|  | IsEditable | Check if property can be edited. |
|  | IsValidSchemaIdentifier | Check that schema name is valid |
|  | RemoveConnectedAsset | Removes the connected asset attached to this asset property if any. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

AssetProperty is the base class or all other AssetProperty sub classes.

#### Reference

Autodesk.Revit.DB.Visual Namespace

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetProperties Autodesk.Revit.DB.VisualAssetPropertyBoolean Autodesk.Revit.DB.VisualAssetPropertyDistance Autodesk.Revit.DB.VisualAssetPropertyDouble Autodesk.Revit.DB.VisualAssetPropertyDoubleArray2d Autodesk.Revit.DB.VisualAssetPropertyDoubleArray3d Autodesk.Revit.DB.VisualAssetPropertyDoubleArray4d Autodesk.Revit.DB.VisualAssetPropertyDoubleMatrix44 Autodesk.Revit.DB.VisualAssetPropertyEnum Autodesk.Revit.DB.VisualAssetPropertyFloat Autodesk.Revit.DB.VisualAssetPropertyFloatArray Autodesk.Revit.DB.VisualAssetPropertyInt64 Autodesk.Revit.DB.VisualAssetPropertyInteger Autodesk.Revit.DB.VisualAssetPropertyList Autodesk.Revit.DB.VisualAssetPropertyReference Autodesk.Revit.DB.VisualAssetPropertyString Autodesk.Revit.DB.VisualAssetPropertyTime Autodesk.Revit.DB.VisualAssetPropertyUInt64